
#include <sys/socket.h>
#include <netinet/in.h>
#include <sys/types.h>
#include <signal.h>
#include <sys/mman.h>
#include <sys/types.h>
#include <sys/wait.h>
#include <unistd.h>
#include <errno.h>
#include <fcntl.h>
#include <arpa/inet.h>
#include <pthread.h>
#include <netdb.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <iostream>
#include <iostream>
#include <string>
#include <sstream>
#include <queue>
#include <stack>
#include <pthread.h>


#include "include/ThostFtdcUserApiDataType.h"
#include "include/ThostFtdcTraderApi.h"
#include "include/ThostFtdcUserApiStruct.h"
#include "include/ThostFtdcMdApi.h"

using namespace std;


#define response_size 1024

#define BUFSIZE 1024

//////////////////////////////////Initial Thread//////////////////////////////////

int TCP_server_to_send_socket,TCP_server_socket, newSocket;
char buffer[1024];

// This variables will be initilized by config file
char str[1024],TCP_IP_Address[24],TCP_UDP_IP_Adrress[20]; 

int TCP_or_UDP,TCP_Port,TCP_UDP_Port, Market_or_Order;

struct sockaddr_in TCP_recv_serverAddr,TCP_recv_serverStorage; // For TCP_recv_server

struct sockaddr_in TCP_send_serverAddr,TCP_send_serverStorage; // For TCP_send_server

socklen_t TCP_send_addr_size,TCP_recv_addr_size;

pthread_mutex_t count_mutex = PTHREAD_MUTEX_INITIALIZER, Mutex_UDP = PTHREAD_MUTEX_INITIALIZER, Mutex_Recv = PTHREAD_MUTEX_INITIALIZER, Mutex_Market = PTHREAD_MUTEX_INITIALIZER;

pthread_cond_t  condition_print  = PTHREAD_COND_INITIALIZER, condition_recv  = PTHREAD_COND_INITIALIZER, condition_var  = PTHREAD_COND_INITIALIZER, condition_Market_start  = PTHREAD_COND_INITIALIZER;

char IPAddress[100],BrokerID[100],UserID[100],Password[100],InvestorID[100];

void Read_from_Config_File(){
    FILE *file = fopen("Market.cfg","r");
    //file = fopen( "D:\\QuantoTrade_Debug\\Sample.txt","r");
    char input[50];
    if ( file == NULL)
    {
        perror("Error");
        return;
    }

    #ifdef WINDOWS
        fscanf_s(file,"%s",input);

        fscanf_s(file,"%s %s",input,input);
        fscanf_s(file,"%d",&  Market_or_Order);

        fscanf_s(file,"%s %s",input,input);
        fscanf_s(file,"%s",IPAddress);
        
        fscanf_s(file,"%s %s",input,input);
        fscanf_s(file,"%s",BrokerID);
        
        fscanf_s(file,"%s %s",input,input);
        fscanf_s(file,"%s",InvestorID);        

        fscanf_s(file,"%s %s",input,input);
        fscanf_s(file,"%s",UserID);
        
        fscanf_s(file,"%s %s",input,input);
        fscanf_s(file,"%s",Password);


    #else
        fscanf(file,"%s",input);
        fscanf(file,"%s %s",input,input);
        fscanf(file,"%d",&Market_or_Order);
        
        fscanf(file,"%s %s",input,input);
        fscanf(file,"%s",IPAddress);
        
        fscanf(file,"%s %s",input,input);
        fscanf(file,"%s",BrokerID);

        fscanf(file,"%s %s",input,input);
        fscanf(file,"%s",InvestorID);        

        fscanf(file,"%s %s",input,input);
        fscanf(file,"%s",UserID);

        fscanf(file,"%s %s",input,input);
        fscanf(file,"%s",Password);
    
        /*Reading from config file*/
        fscanf(file,"%s %s %d",str,str,&TCP_or_UDP);
        fscanf(file,"%s %s %s",str,str,TCP_IP_Address);
        fscanf(file,"%s %s %d",str,str,&TCP_Port);
        fscanf(file,"%s %s %s",str,str,TCP_UDP_IP_Adrress);
        fscanf(file,"%s %s %d",str,str,&TCP_UDP_Port);
        printf("Port Number:- %d it's TCP port, TCP_IP_Address is %s and it's used to receive the request from the client!!!!!!\n",TCP_Port,TCP_IP_Address);
        if(!TCP_or_UDP){
            printf("Port Number:- %d it's TCP port, IP_Address is %s and it's used to Send the response to the client!!!!!!\n",TCP_UDP_Port,TCP_UDP_IP_Adrress);
        }
        else{
            printf("Port Number:- %d it's UDP port , UDP_IP_Address is %s and it's used to send the response to the client!!!!!!\n",TCP_UDP_Port,TCP_UDP_IP_Adrress);
        }

    #endif
        fclose(file);
}

struct CTPObj
{
    string  ReqBeginString;
    string  ReqLength;
    string  ReqOrderReqType;
    string  ReqRequestID;
    string  ReqSenderCompID;
    string  ReqSendingTime;
    string  ReqTargetCompID;
    string  ReqAccountID;
    string  ReqOrderRef;
    string  ReqConst;
    string  ReqLimitPrice;
    string  ReqOrderPriceType;
    string  ReqOrderQty;
    string  ReqDirection;
    string  ReqInstrumentID;
    string  ReqTransactTime;
    string  ReqFUT;
    string  ReqExpiryDate;
    string  ReqExchangeID;
    string  ReqChecksum;

    string  OnRspAccountID;  //1  
    string  OnRspAvgTime;  //6  
    string  OnRspOrderRef;  //11  
    string  OnRspVolumeTraded;  //14  
    string  OnRspLastPartiallyFilled;  //32  
    string  OnRspRequestID;  //37  
    string  OnRspVolumeTotalOriginal;  //38  
    string  OnRspOrderStatusType;  //39  
    /*     0 - New (THOST_FTDC_OST_Touched)
         1 - Partially Filled (THOST_FTDC_OST_PartTradedQueueing)
         2 - Filled (THOST_FTDC_OST_AllTraded)
         3 - Done for the Day
         4 - Cancel (THOST_FTDC_OST_Canceled)
         5 - Replaced 
         6 - Pending Cancel
         7 - Stopped
         8 - Reject
    */
    string  OnRspOrderType;  //54  
    string  OnRspCUSIP;  //48  
    string  OnRspExecutionTime;  //60  
    string  OnRspMarketOrderPrice;  //44  
    string  OnRspPendingQuantity;  //151  //**Orginal - Traded**//
    string  OnRspExchange;  //207  



    string  MarketInstrumentID;

    /******Market***/
    string AskPrice1; 
    string AskPrice2;
    string AskPrice3;
    string AskPrice4;
    string AskPrice5;

    string AskVolume1;
    string AskVolume2;
    string AskVolume3;
    string AskVolume4;
    string AskVolume5;

    string BidPrice1;
    string BidPrice2;
    string BidPrice3;
    string BidPrice4;
    string BidPrice5;

    string BidVolume1;
    string BidVolume2;
    string BidVolume3;
    string BidVolume4;
    string BidVolume5;

};
typedef struct CTPObj CTPStructure ;

queue<string> QUEUE_FIX_SEND,QUEUE_FIX_RECEIVED;
queue <CTPObj> QUEUE_CTPObj_RECEIVED,QUEUE_CTPObj_SEND;

string FixINString,FixOUTString;
CTPStructure ObjIN,ObjOUT;
//#include "Shanghai_market.h"

void printObject(CTPStructure Object)
{
    /****************************************************/
    printf("BeginString:%s\t\n", Object.ReqBeginString.c_str());
